Revit 2026 API

# MasonryCMUMasonryCMUColorByObject Property

---

The property labeled "Color By Object" from the "MasonryCMU" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MasonryCMUColorByObject { get; }
```
```vb
Public Shared ReadOnly Property MasonryCMUColorByObject As String
	Get
```
```cpp
public:
static property String^ MasonryCMUColorByObject {
	String^ get ();
}
```
```fsharp
static member MasonryCMUColorByObject : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

MasonryCMU Class

Autodesk.Revit.DB.Visual Namespace